parsing-tech-log/src/Catalogs/СобытияЗамера/СобытияЗамера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СобытияЗамера</name>
  <owners>Catalog.Замеры</owners>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ФайлыЗамера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытияМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеСвойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.Свойства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/СобытияЗамера/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	СформироватьНаименование();
	СформироватьХеши();
КонецПроцедуры

Процедура СформироватьНаименование()
	Наименование = СтрШаблон("%1.%2-%3",
		Формат(ДатаСобытия,"ДФ=мм:сс;"), 
		Формат(ДатаСобытияМкс,"ЧЦ=6; ЧН=0; ЧВН=; ЧГ=;"), 
		Формат(ДлительностьМкс, "ЧН=0; ЧГ=;")); 	
КонецПроцедуры

Процедура СформироватьХеши()
	Для Каждого строкасвойства из КлючевыеСвойства Цикл
		Если СтрДлина(строкасвойства.Значение)<=28 Тогда
			строкасвойства.ХешЗначения = строкасвойства.Значение;
		Иначе
			хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
			хеширование.Добавить(строкасвойства.Значение);
			строкасвойства.ХешЗначения = Base64Строка(хеширование.ХешСумма);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
